import React from 'react';
import styles from './index.module.less';
import CustomNav from '@/pages/components/Nav';

const Privacy: React.FC = () => {
  return (
    <div className={styles.privacy}>
      <CustomNav title="用户协议" />
      <div className={styles.container}>
        <div className={styles.title}>用户协议</div>
        <div className={styles.time}>更新日期：2025年10月23日</div>
        <div className={styles.time}>生效日期：2025年10月23日</div>
        <div className={styles.content}>驷马河国家湿地公园位于驷马省级自然保护区内，主要包括驷马河、高坑河、徐家河、花溪河及周边湿地区域，南北跨度18.45千米，总面积372.98公顷，其中湿地面积155.78公顷，湿地率41.77 %，是嘉陵江上游保存较为完好的自然河流生态系统，也是川东北山地向丘陵过渡地带“河流—森林”复合湿地生态系统的典型代表，保护着长江上游中小河流源头地区的珍贵特有鱼类种质资源。
          驷马河国家湿地公园位于驷马省级自然保护区内，主要包括驷马河、高坑河、徐家河、花溪河及周边湿地区域，南北跨度18.45千米，总面积372.98公顷，其中湿地面积155.78公顷，湿地率41.77 %，是嘉陵江上游保存较为完好的自然河流生态系统，也是川东北山地向丘陵过渡地带“河流—森林”复合湿地生态系统的典型代表，保护着长江上游中小河流源头地区的珍贵特有鱼类种质资源。
          驷马河国家湿地公园位于驷马省级自然保护区内，主要包括驷马河、高坑河、徐家河、花溪河及周边湿地区域，南北跨度18.45千米，总面积372.98公顷，其中湿地面积155.78公顷，湿地率41.77 %，是嘉陵江上游保存较为完好的自然河流生态系统，也是川东北山地向丘陵过渡地带“河流—森林”复合湿地生态系统的典型代表，保护着长江上游中小河流源头地区的珍贵特有鱼类种质资源。驷马河国家湿地公园位于驷马省级自然保护区内，主要包括驷马河、高坑河、徐家河、花溪河及周边湿地区域，南北跨度18.45千米，总面积372.98公顷，其中湿地面积155.78公顷，湿地率41.77 %，是嘉陵江上游保存较为完好的自然河流生态系统，也是川东北山地向丘陵过渡地带“河流—森林”复合湿地生态系统的典型代表，保护着长江上游中小河流源头地区的珍贵特有鱼类种质资源。</div>
      </div>
    </div>
  );
};

export default Privacy;
